; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 59236 2 1 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	image3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
)
(:goal (and
	(pointing satellite0 Planet5)
	(pointing satellite1 Planet5)
	(have_image Star3 image3)
	(have_image Phenomenon4 spectrograph2)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 planet5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet5)
   goals met: 1 of 7
3. (turn_to satellite1 groundstation1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 7
4. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 7
5. (turn_to satellite1 star3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star3)
   goals met: 1 of 7
6. (take_image satellite1 star3 instrument1 image3)
   added: (have_image star3 image3)
   goals met: 2 of 7
7. (turn_to satellite1 planet6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet6)
   goals met: 2 of 7
8. (take_image satellite1 planet6 instrument1 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 3 of 7
9. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   goals met: 4 of 7
10. (take_image satellite1 planet5 instrument1 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 5 of 7
11. (turn_to satellite1 phenomenon7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 7
12. (take_image satellite1 phenomenon7 instrument1 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 5 of 7
13. (turn_to satellite1 planet5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet5)
   goals met: 6 of 7
14. (turn_to satellite1 phenomenon4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon4)
   goals met: 5 of 7
15. (take_image satellite1 phenomenon4 instrument1 spectrograph2)
   added: (have_image phenomenon4 spectrograph2)
   goals met: 6 of 7
16. (turn_to satellite1 planet5 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet5)
   goals met: 7 of 7
